"""
Задайте последовательность чисел.
Напишите программу, которая выведет список
неповторяющихся элементов исходной последовательности.
"""
my_list = [1,4,7,4,3,9,10,4,12,4,2]
print(set(my_list))